In [1]:
import pandas as pd 
import numpy as np

v1 = np.random.randint(0,10 ,size = 5)
v2 = np.random.randint(0 ,10 ,size = 5)
v3 = np.random.randint(0 ,10 ,size = 5)

sozluk = {
    "var1" : v1,
    "var2" : v2,
    "var3" : v3
}


df = pd.DataFrame(sozluk ,index = ["a" ,"b" ,"c" ,"d" ,"e"])

In [2]:
df

   var1  var2  var3
a     9     1     6
b     1     9     6
c     2     8     1
d     9     5     1
e     7     7     0

In [3]:
df["a" : "c"]

   var1  var2  var3
a     9     1     6
b     1     9     6
c     2     8     1

In [4]:
df.drop("b") 
#inplace = True yakılmazsa df de değişiklik yapılmaz

   var1  var2  var3
a     9     1     6
c     2     8     1
d     9     5     1
e     7     7     0

In [5]:
df.drop("var3" ,axis = 1)
# column bazında silme işlemi yapabilmek için axis = 1 yaptık

   var1  var2
a     9     1
b     1     9
c     2     8
d     9     5
e     7     7

In [6]:
df.drop("e" ,inplace = True)
df
# inplace argumanı True olduğu için işlem geçerli kılındı

   var1  var2  var3
a     9     1     6
b     1     9     6
c     2     8     1
d     9     5     1

In [7]:
"var1" in df
# df nin içinde var 1 var mı

True

In [8]:
"a" in df
#indexlerde arama yapmaz

False

In [9]:
df["var1"] is df["var1"]
# df içindeki var1 sutunu var1 sutununa eşit mi ?

True

In [10]:
l = ["var1" ,"var2" ,"var4"]

for i in l:
    print(i in df)

True
True
False

In [11]:
liste = ["var1" ,"var2"]
df[liste]

   var1  var2
a     9     1
b     1     9
c     2     8
d     9     5

In [12]:
df.drop(liste, axis = 1)

   var3
a     6
b     6
c     1
d     1

 Loc ve iLoc işlemleri

In [13]:
df

   var1  var2  var3
a     9     1     6
b     1     9     6
c     2     8     1
d     9     5     1

In [14]:
df[0:3]

   var1  var2  var3
a     9     1     6
b     1     9     6
c     2     8     1

In [15]:
df[0:3 ,"var1" ,"var2"]
# iki boyutlu sorgulama yaptığımız zaman loc ve iloc işin içine girer

TypeError: '(slice(0, 3, None), 'var1', 'var2')' is an invalid key

In [ ]:
df.loc["a" : "c" ,  "var1" : "var2"]

In [ ]:
df.iloc[0:3 , 0 : 2]

In [16]:
df[df.var1 > 5 ]
# df içinde var1 i 5 den buyuk olan tüm satırları getir

   var1  var2  var3
a     9     1     6
d     9     5     1

In [17]:
df[df.var1 > 5 ]["var1"]
# df içinde var1 de 5 ten butuk olan satırları geitr

a    9
d    9
Name: var1, dtype: int32

In [18]:
df.loc[df.var1 > 5 ,["var1"]]
#yukardaki işlemin farklı kullanımı ve df halinde getirilmişi

   var1
a     9
d     9

## birleştirme işlemleri

In [19]:
df

   var1  var2  var3
a     9     1     6
b     1     9     6
c     2     8     1
d     9     5     1

In [20]:
df2 = df + 99

In [21]:
df2

   var1  var2  var3
a   108   100   105
b   100   108   105
c   101   107   100
d   108   104   100

In [22]:
pd.concat([df , df2]) 
#alt alta birleştirme

   var1  var2  var3
a     9     1     6
b     1     9     6
c     2     8     1
d     9     5     1
a   108   100   105
b   100   108   105
c   101   107   100
d   108   104   100

In [23]:
pd.concat([df ,df2] ,axis = 1)
# yan yana birleştirme

   var1  var2  var3  var1  var2  var3
a     9     1     6   108   100   105
b     1     9     6   100   108   105
c     2     8     1   101   107   100
d     9     5     1   108   104   100

In [24]:
pd.concat([df ,df2] ,ignore_index = True)
# indexleri default olarak ata

   var1  var2  var3
0     9     1     6
1     1     9     6
2     2     8     1
3     9     5     1
4   108   100   105
5   100   108   105
6   101   107   100
7   108   104   100

## ileri birleştirme işlemleri Merge ve Join

In [25]:
df

   var1  var2  var3
a     9     1     6
b     1     9     6
c     2     8     1
d     9     5     1

In [26]:
df2

   var1  var2  var3
a   108   100   105
b   100   108   105
c   101   107   100
d   108   104   100

In [27]:
pd.concat([df ,df2])

   var1  var2  var3
a     9     1     6
b     1     9     6
c     2     8     1
d     9     5     1
a   108   100   105
b   100   108   105
c   101   107   100
d   108   104   100

In [28]:
pd.concat([df ,df2] ,ignore_index = True)

   var1  var2  var3
0     9     1     6
1     1     9     6
2     2     8     1
3     9     5     1
4   108   100   105
5   100   108   105
6   101   107   100
7   108   104   100

In [29]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [30]:
df2.columns = ["var1" ,"var2" ,"değ1"]

In [31]:
pd.concat([df ,df2])
# df lerde değerlerin eşteniği olmadığı içi nan olarak atandı

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    değ1  var1  var2  var3
a    NaN     9     1   6.0
b    NaN     1     9   6.0
c    NaN     2     8   1.0
d    NaN     9     5   1.0
a  105.0   108   100   NaN
b  105.0   100   108   NaN
c  100.0   101   107   NaN
d  100.0   108   104   NaN

In [32]:
pd.concat([df , df2] ,join = "inner")
#eğer joini inner yaparsa ikisindede ortak olan değerler gelir

   var1  var2
a     9     1
b     1     9
c     2     8
d     9     5
a   108   100
b   100   108
c   101   107
d   108   104

In [33]:
pd.concat([df ,df2] ,join_axes = [df.columns])
# join axes ile df in sutunlarına göre birleştirme yaptık

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

   var1  var2  var3
a     9     1   6.0
b     1     9   6.0
c     2     8   1.0
d     9     5   1.0
a   108   100   NaN
b   100   108   NaN
c   101   107   NaN
d   108   104   NaN

Merge join

In [34]:
df1 = pd.DataFrame(
    {
        "calisanlar" : ["Ali" ,"Veli" ,"Ayse" ,"Fatma"],
        "grup" : ["Muhasebe" ,"Muhendislik" ,"Muhendislik", "IK"] 
    }
)
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [35]:
df2 = pd.DataFrame(
    {
        "calisanlar" : ["Veli" ,"Ali" ,"Ayse" ,"Fatma"],
        "ilk_giris" :[2001 ,2004 ,2003 ,2017]
        
    }
)

df2

  calisanlar  ilk_giris
0       Veli       2001
1        Ali       2004
2       Ayse       2003
3      Fatma       2017

In [36]:
df4 = pd.DataFrame(
    {
        "grup" : ["Muhasebe" ,"IK" ,"Muhendislik"],
        "mudur" : ["Caner" ,"Mustafa" ,"Berkcan"]
    }

)
df4

          grup    mudur
0     Muhasebe    Caner
1           IK  Mustafa
2  Muhendislik  Berkcan

In [37]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [38]:
df2

  calisanlar  ilk_giris
0       Veli       2001
1        Ali       2004
2       Ayse       2003
3      Fatma       2017

In [39]:
pd.merge(df1 ,df2)
# kendisi ortak sutunu bulup birleştirme işlemini yapar dilersek kendimizde atayabliriz

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2004
1       Veli  Muhendislik       2001
2       Ayse  Muhendislik       2003
3      Fatma           IK       2017

In [40]:
import pandas as pd 
pd.merge(df1 ,df2 )

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2004
1       Veli  Muhendislik       2001
2       Ayse  Muhendislik       2003
3      Fatma           IK       2017

In [41]:
pd.merge(df1 ,df2 ,on = "calisanlar")
# calsanlar grubunu esas olarak birleştirme işlemi yaptık

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2004
1       Veli  Muhendislik       2001
2       Ayse  Muhendislik       2003
3      Fatma           IK       2017

In [42]:
import pandas as pd 
import numpy as np

v1 = np.random.randint(0,10 ,size = 5)
v2 = np.random.randint(0 ,10 ,size = 5)
v3 = np.random.randint(0 ,10 ,size = 5)

sozluk = {
    "var1" : v1,
    "var2" : v2,
    "var3" : v3
}


df = pd.DataFrame(sozluk ,index = ["a" ,"b" ,"c" ,"d" ,"e"])

In [43]:
df

   var1  var2  var3
a     6     2     5
b     8     9     8
c     6     6     2
d     6     1     5
e     4     1     0

In [44]:
df["a" : "c"]

   var1  var2  var3
a     6     2     5
b     8     9     8
c     6     6     2

In [45]:
df.drop("b") 
#inplace = True yakılmazsa df de değişiklik yapılmaz

   var1  var2  var3
a     6     2     5
c     6     6     2
d     6     1     5
e     4     1     0

In [46]:
df.drop("var3" ,axis = 1)
# column bazında silme işlemi yapabilmek için axis = 1 yaptık

   var1  var2
a     6     2
b     8     9
c     6     6
d     6     1
e     4     1

In [47]:
df.drop("e" ,inplace = True)
df
# inplace argumanı True olduğu için işlem geçerli kılındı

   var1  var2  var3
a     6     2     5
b     8     9     8
c     6     6     2
d     6     1     5

In [48]:
"var1" in df
# df nin içinde var 1 var mı

True

In [49]:
"a" in df
#indexlerde arama yapmaz

False

In [50]:
df["var1"] is df["var1"]
# df içindeki var1 sutunu var1 sutununa eşit mi ?

True

In [51]:
l = ["var1" ,"var2" ,"var4"]

for i in l:
    print(i in df)

True
True
False

In [52]:
liste = ["var1" ,"var2"]
df[liste]

   var1  var2
a     6     2
b     8     9
c     6     6
d     6     1

In [53]:
df.drop(liste, axis = 1)

   var3
a     5
b     8
c     2
d     5

 Loc ve iLoc işlemleri

In [54]:
df

   var1  var2  var3
a     6     2     5
b     8     9     8
c     6     6     2
d     6     1     5

In [55]:
df[0:3]

   var1  var2  var3
a     6     2     5
b     8     9     8
c     6     6     2

In [56]:
df[0:3 ,"var1" ,"var2"]
# iki boyutlu sorgulama yaptığımız zaman loc ve iloc işin içine girer

TypeError: '(slice(0, 3, None), 'var1', 'var2')' is an invalid key

In [57]:
df.loc["a" : "c" ,  "var1" : "var2"]

   var1  var2
a     6     2
b     8     9
c     6     6

In [58]:
df.iloc[0:3 , 0 : 2]

   var1  var2
a     6     2
b     8     9
c     6     6

In [59]:
df[df.var1 > 5 ]
# df içinde var1 i 5 den buyuk olan tüm satırları getir

   var1  var2  var3
a     6     2     5
b     8     9     8
c     6     6     2
d     6     1     5

In [60]:
df[df.var1 > 5 ]["var1"]
# df içinde var1 de 5 ten butuk olan satırları geitr

a    6
b    8
c    6
d    6
Name: var1, dtype: int32

In [61]:
df.loc[df.var1 > 5 ,["var1"]]
#yukardaki işlemin farklı kullanımı ve df halinde getirilmişi

   var1
a     6
b     8
c     6
d     6

## birleştirme işlemleri

In [62]:
df

   var1  var2  var3
a     6     2     5
b     8     9     8
c     6     6     2
d     6     1     5

In [63]:
df2 = df + 99

In [64]:
df2

   var1  var2  var3
a   105   101   104
b   107   108   107
c   105   105   101
d   105   100   104

In [65]:
pd.concat([df , df2]) 
#alt alta birleştirme

   var1  var2  var3
a     6     2     5
b     8     9     8
c     6     6     2
d     6     1     5
a   105   101   104
b   107   108   107
c   105   105   101
d   105   100   104

In [66]:
pd.concat([df ,df2] ,axis = 1)
# yan yana birleştirme

   var1  var2  var3  var1  var2  var3
a     6     2     5   105   101   104
b     8     9     8   107   108   107
c     6     6     2   105   105   101
d     6     1     5   105   100   104

In [67]:
pd.concat([df ,df2] ,ignore_index = True)
# indexleri default olarak ata

   var1  var2  var3
0     6     2     5
1     8     9     8
2     6     6     2
3     6     1     5
4   105   101   104
5   107   108   107
6   105   105   101
7   105   100   104

## ileri birleştirme işlemleri Merge ve Join

In [68]:
df

   var1  var2  var3
a     6     2     5
b     8     9     8
c     6     6     2
d     6     1     5

In [69]:
df2

   var1  var2  var3
a   105   101   104
b   107   108   107
c   105   105   101
d   105   100   104

In [70]:
pd.concat([df ,df2])

   var1  var2  var3
a     6     2     5
b     8     9     8
c     6     6     2
d     6     1     5
a   105   101   104
b   107   108   107
c   105   105   101
d   105   100   104

In [71]:
pd.concat([df ,df2] ,ignore_index = True)

   var1  var2  var3
0     6     2     5
1     8     9     8
2     6     6     2
3     6     1     5
4   105   101   104
5   107   108   107
6   105   105   101
7   105   100   104

In [72]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [73]:
df2.columns = ["var1" ,"var2" ,"değ1"]

In [74]:
pd.concat([df ,df2])
# df lerde değerlerin eşteniği olmadığı içi nan olarak atandı

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    değ1  var1  var2  var3
a    NaN     6     2   5.0
b    NaN     8     9   8.0
c    NaN     6     6   2.0
d    NaN     6     1   5.0
a  104.0   105   101   NaN
b  107.0   107   108   NaN
c  101.0   105   105   NaN
d  104.0   105   100   NaN

In [75]:
pd.concat([df , df2] ,join = "inner")
#eğer joini inner yaparsa ikisindede ortak olan değerler gelir

   var1  var2
a     6     2
b     8     9
c     6     6
d     6     1
a   105   101
b   107   108
c   105   105
d   105   100

In [76]:
pd.concat([df ,df2] ,join_axes = [df.columns])
# join axes ile df in sutunlarına göre birleştirme yaptık

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

   var1  var2  var3
a     6     2   5.0
b     8     9   8.0
c     6     6   2.0
d     6     1   5.0
a   105   101   NaN
b   107   108   NaN
c   105   105   NaN
d   105   100   NaN

Merge join

In [77]:
df1 = pd.DataFrame(
    {
        "calisanlar" : ["Ali" ,"Veli" ,"Ayse" ,"Fatma"],
        "grup" : ["Muhasebe" ,"Muhendislik" ,"Muhendislik", "IK"] 
    }
)
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [78]:
df2 = pd.DataFrame(
    {
        "calisanlar" : ["Veli" ,"Ali" ,"Ayse" ,"Fatma"],
        "ilk_giris" :[2001 ,2004 ,2003 ,2017]
        
    }
)

df2

  calisanlar  ilk_giris
0       Veli       2001
1        Ali       2004
2       Ayse       2003
3      Fatma       2017

In [79]:
df4 = pd.DataFrame(
    {
        "grup" : ["Muhasebe" ,"IK" ,"Muhendislik"],
        "mudur" : ["Caner" ,"Mustafa" ,"Berkcan"]
    }

)
df4

          grup    mudur
0     Muhasebe    Caner
1           IK  Mustafa
2  Muhendislik  Berkcan

In [80]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [81]:
df2

  calisanlar  ilk_giris
0       Veli       2001
1        Ali       2004
2       Ayse       2003
3      Fatma       2017

In [82]:
pd.merge(df1 ,df2)
# kendisi ortak sutunu bulup birleştirme işlemini yapar dilersek kendimizde atayabliriz

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2004
1       Veli  Muhendislik       2001
2       Ayse  Muhendislik       2003
3      Fatma           IK       2017

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2004
1       Veli  Muhendislik       2001
2       Ayse  Muhendislik       2003
3      Fatma           IK       2017

In [84]:
pd.merge(df1 ,df2 ,on = "calisanlar")
# calsanlar grubunu esas olarak birleştirme işlemi yaptık

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2004
1       Veli  Muhendislik       2001
2       Ayse  Muhendislik       2003
3      Fatma           IK       2017

In [90]:
df2.columns = ["isciler", "ilk_giris"]

In [91]:
df2

  isciler  ilk_giris
0    Veli       2001
1     Ali       2004
2    Ayse       2003
3   Fatma       2017

In [92]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [94]:
pd.merge(df1 ,df2) 
# isimleri farklı olduğu için kendimiz belirtmeliyiz

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [96]:
pd.merge(df1 ,df2 , left_on = "calisanlar"  ,right_on = "isciler")
# ama bu işlemi yapınca coklama işlemi olur bunuda droplama ile silebiliriz

  calisanlar         grup isciler  ilk_giris
0        Ali     Muhasebe     Ali       2004
1       Veli  Muhendislik    Veli       2001
2       Ayse  Muhendislik    Ayse       2003
3      Fatma           IK   Fatma       2017

In [100]:
pd.merge(df1 ,df2 , left_on = "calisanlar"  ,right_on = "isciler").drop("isciler" ,axis = 1)
# tekrarlamaları kaldırarak verimizi temizlemiş olduk

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2004
1       Veli  Muhendislik       2001
2       Ayse  Muhendislik       2003
3      Fatma           IK       2017

AttributeError: module 'pandas' has no attribute 'join'

In [107]:
# column değerini indexlere atamak

In [108]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [110]:
df1a  = df1.set_index("calisanlar")

In [111]:
df1a

                   grup
calisanlar
Ali            Muhasebe
Veli        Muhendislik
Ayse        Muhendislik
Fatma                IK

In [115]:
df2

  calisanlar  ilk_giris
0       Veli       2001
1        Ali       2004
2       Ayse       2003
3      Fatma       2017

In [116]:
df2a = df2.set_index("calisanlar")

In [118]:
pd.merge(df1a ,df2a) 
#indexler üzerinden join yapacağımızı belirtmez isek hata alırız

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [119]:
pd.merge(df1a ,df2a ,left_index = True ,right_index = True)

                   grup  ilk_giris
calisanlar
Ali            Muhasebe       2004
Veli        Muhendislik       2001
Ayse        Muhendislik       2003
Fatma                IK       2017

In [120]:
df1a.join(df2a)

                   grup  ilk_giris
calisanlar
Ali            Muhasebe       2004
Veli        Muhendislik       2001
Ayse        Muhendislik       2003
Fatma                IK       2017

In [122]:
# column isimlendirme hatasını giderme

In [123]:
dfa = pd.DataFrame(
    {
        "calisanlar" : ["Ali" ,"Veli" ,"Ayse" ,"Fatma"],
        "siralama" : [1 ,2 ,3 ,4]
    }
)
dfa

  calisanlar  siralama
0        Ali         1
1       Veli         2
2       Ayse         3
3      Fatma         4

In [125]:
dfb  = pd.DataFrame(
    {
        "calisanlar" : ["Ali" ,"Veli" ,"Ayse" ,"Fatma"],
        "siralama" : [3 ,1 ,4 ,2]
        
    }

)

dfb

  calisanlar  siralama
0        Ali         3
1       Veli         1
2       Ayse         4
3      Fatma         2

In [128]:
pd.merge(dfa ,dfb)
# dfa ile dfb de columnlar aytı ama bu sıralamalar başka birşeyin sıralamaları olur bunu istersen kendimiz isimlendirebiliriz

Empty DataFrame
Columns: [calisanlar, siralama]
Index: []

In [130]:
pd.merge(dfa ,dfb ,on = "calisanlar")
#evet calısanlar üzerinde isimlendirdiğimizde sıralamaları x ve ey olarak adlandırdı 
# bunu çozmek için manual olarak isim girmemiz gerekir

  calisanlar  siralama_x  siralama_y
0        Ali           1           3
1       Veli           2           1
2       Ayse           3           4
3      Fatma           4           2

In [137]:
pd.merge(dfa ,dfb ,on = "calisanlar" , suffixes=("_Basarı", "_Rütbe"))

  calisanlar  siralama_Basarı  siralama_Rütbe
0        Ali                1               3
1       Veli                2               1
2       Ayse                3               4
3      Fatma                4               2